{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/home/ivanov.dko/projects/test/rl/artifacts/models/lvwerra/distilbert-imdb-cased",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "scores"
  ],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "classifier",
    "k_lin",
    "q_lin",
    "pre_classifier",
    "lin2",
    "out_lin",
    "lin1",
    "v_lin"
  ],
  "task_type": "LoraConfig.TaskType.SEQ_CLS",
  "use_dora": false,
  "use_rslora": false
}